

Run code & output:


Model Summaries:

Model: "1_Layer"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 Conv2D-1 (Conv2D)           (None, 26, 26, 32)        320       
                                                                 
 MaxPool (MaxPooling2D)      (None, 13, 13, 32)        0         
                                                                 
 Dropout (Dropout)           (None, 13, 13, 32)        0         
                                                                 
 flatten (Flatten)           (None, 5408)              0         
                                                                 
 Dense (Dense)               (None, 32)                173088    
                                                                 
 Output (Dense)              (None, 10)                330       
                                                                 
=================================================================
Total params: 173738 (678.66 KB)
Trainable params: 173738 (678.66 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Model: "2_Layer"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 Conv2D-1 (Conv2D)           (None, 26, 26, 32)        320       
                                                                 
 MaxPool (MaxPooling2D)      (None, 13, 13, 32)        0         
                                                                 
 Dropout-1 (Dropout)         (None, 13, 13, 32)        0         
                                                                 
 Conv2D-2 (Conv2D)           (None, 11, 11, 64)        18496     
                                                                 
 Dropout-2 (Dropout)         (None, 11, 11, 64)        0         
                                                                 
 flatten (Flatten)           (None, 7744)              0         
                                                                 
 Dense (Dense)               (None, 64)                495680    
                                                                 
 Output (Dense)              (None, 10)                650       
                                                                 
=================================================================
Total params: 515146 (1.97 MB)
Trainable params: 515146 (1.97 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________
Model: "3_layer"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 Conv2D-1 (Conv2D)           (None, 26, 26, 32)        320       
                                                                 
 MaxPool (MaxPooling2D)      (None, 13, 13, 32)        0         
                                                                 
 Dropout-1 (Dropout)         (None, 13, 13, 32)        0         
                                                                 
 Conv2D-2 (Conv2D)           (None, 11, 11, 64)        18496     
                                                                 
 Dropout-2 (Dropout)         (None, 11, 11, 64)        0         
                                                                 
 Conv2D-3 (Conv2D)           (None, 9, 9, 128)         73856     
                                                                 
 Dropout-3 (Dropout)         (None, 9, 9, 128)         0         
                                                                 
 flatten (Flatten)           (None, 10368)             0         
                                                                 
 Dense (Dense)               (None, 128)               1327232   
                                                                 
 Dropout (Dropout)           (None, 128)               0         
                                                                 
 Output (Dense)              (None, 10)                1290      
                                                                 
=================================================================
Total params: 1421194 (5.42 MB)
Trainable params: 1421194 (5.42 MB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________








Accuracy :


Epoch 22/50
94/94 [==============================] - 97s 1s/step - loss: 0.1999 - accuracy: 0.9259 - val_loss: 0.2168 - val_accuracy: 0.9204
Epoch 23/50
94/94 [==============================] - 103s 1s/step - loss: 0.2000 - accuracy: 0.9263 - val_loss: 0.2135 - val_accuracy: 0.9227
Epoch 24/50
94/94 [==============================] - 99s 1s/step - loss: 0.1972 - accuracy: 0.9255 - val_loss: 0.2100 - val_accuracy: 0.9250
Epoch 25/50
94/94 [==============================] - 97s 1s/step - loss: 0.1912 - accuracy: 0.9278 - val_loss: 0.2147 - val_accuracy: 0.9223
Epoch 26/50
94/94 [==============================] - 106s 1s/step - loss: 0.1845 - accuracy: 0.9306 - val_loss: 0.2110 - val_accuracy: 0.9254
Epoch 27/50
94/94 [==============================] - 104s 1s/step - loss: 0.1835 - accuracy: 0.9295 - val_loss: 0.2109 - val_accuracy: 0.9260
Epoch 28/50
94/94 [==============================] - 105s 1s/step - loss: 0.1821 - accuracy: 0.9311 - val_loss: 0.2098 - val_accuracy: 0.9243
Epoch 29/50
94/94 [==============================] - 102s 1s/step - loss: 0.1758 - accuracy: 0.9336 - val_loss: 0.2151 - val_accuracy: 0.9235
Epoch 30/50
94/94 [==============================] - 102s 1s/step - loss: 0.1735 - accuracy: 0.9348 - val_loss: 0.2142 - val_accuracy: 0.9263
Epoch 31/50
94/94 [==============================] - 104s 1s/step - loss: 0.1692 - accuracy: 0.9362 - val_loss: 0.2197 - val_accuracy: 0.9262
Epoch 32/50
94/94 [==============================] - 102s 1s/step - loss: 0.1704 - accuracy: 0.9375 - val_loss: 0.2068 - val_accuracy: 0.9282
Epoch 33/50
94/94 [==============================] - 104s 1s/step - loss: 0.1637 - accuracy: 0.9371 - val_loss: 0.2191 - val_accuracy: 0.9262
Epoch 34/50
94/94 [==============================] - 98s 1s/step - loss: 0.1600 - accuracy: 0.9388 - val_loss: 0.2209 - val_accuracy: 0.9246
Epoch 35/50
94/94 [==============================] - 99s 1s/step - loss: 0.1602 - accuracy: 0.9397 - val_loss: 0.2135 - val_accuracy: 0.9278
Epoch 36/50
94/94 [==============================] - 106s 1s/step - loss: 0.1590 - accuracy: 0.9393 - val_loss: 0.2079 - val_accuracy: 0.9279
Epoch 37/50
94/94 [==============================] - 99s 1s/step - loss: 0.1553 - accuracy: 0.9426 - val_loss: 0.2162 - val_accuracy: 0.9276
Epoch 38/50
94/94 [==============================] - 102s 1s/step - loss: 0.1537 - accuracy: 0.9414 - val_loss: 0.2095 - val_accuracy: 0.9282
Epoch 39/50
94/94 [==============================] - 97s 1s/step - loss: 0.1575 - accuracy: 0.9405 - val_loss: 0.2185 - val_accuracy: 0.9251
Epoch 40/50
94/94 [==============================] - 104s 1s/step - loss: 0.1491 - accuracy: 0.9428 - val_loss: 0.2145 - val_accuracy: 0.9283
Epoch 41/50
94/94 [==============================] - 105s 1s/step - loss: 0.1483 - accuracy: 0.9440 - val_loss: 0.2161 - val_accuracy: 0.9273
Epoch 42/50
94/94 [==============================] - 102s 1s/step - loss: 0.1426 - accuracy: 0.9439 - val_loss: 0.2253 - val_accuracy: 0.9267
Epoch 43/50
94/94 [==============================] - 101s 1s/step - loss: 0.1406 - accuracy: 0.9469 - val_loss: 0.2205 - val_accuracy: 0.9283
Epoch 44/50
94/94 [==============================] - 97s 1s/step - loss: 0.1415 - accuracy: 0.9463 - val_loss: 0.2265 - val_accuracy: 0.9286
Epoch 45/50
94/94 [==============================] - 104s 1s/step - loss: 0.1379 - accuracy: 0.9475 - val_loss: 0.2188 - val_accuracy: 0.9301
Epoch 46/50
94/94 [==============================] - 102s 1s/step - loss: 0.1386 - accuracy: 0.9472 - val_loss: 0.2205 - val_accuracy: 0.9283
Epoch 47/50
94/94 [==============================] - 102s 1s/step - loss: 0.1352 - accuracy: 0.9477 - val_loss: 0.2175 - val_accuracy: 0.9296
Epoch 48/50
94/94 [==============================] - 104s 1s/step - loss: 0.1340 - accuracy: 0.9491 - val_loss: 0.2226 - val_accuracy: 0.9308
Epoch 49/50
94/94 [==============================] - 102s 1s/step - loss: 0.1357 - accuracy: 0.9475 - val_loss: 0.2263 - val_accuracy: 0.9300
Epoch 50/50
94/94 [==============================] - 102s 1s/step - loss: 0.1335 - accuracy: 0.9488 - val_loss: 0.2212 - val_accuracy: 0.9316












